## Introducción a la estadística

# Ejercicio 1
- Introducción a la estadística


### Estadística
Es una rama de las matemáticas que nos permite entender a los datos y sus características
Variablidad, organización, análisis, interpretación y presentación

## Descriptiva
Descripción y visualización de la información.
Resumen de datos originados a partir de un tema de estudio.
Organizar y describir las características del conjunto de datos.
Para interpretarlo a futuro.

## Inferencial
Se dedica a la generación de modelos y predicciones asociados a ciertos fenómenos.


## Análisis exploratorio de datos
Se basa en la Estadística Descriptiva - > Análisis Descriptivo 
Extraer sus características principales.

# Tipos de Datos
- Cualitativo - Categóricos
- Cuantitativo - Representan una cantidad

# Tipos de Variables

- Cuantitativa nominal: Los valores de la variable clasifican a la población en categorías excluyentes.
- Cuantitativa ordinal: Valores que toma la variable que pueden ser ordenados.
- Cuantitativa discreta: Son datos numéricos que pueden tomar solo algunos valores.
- Cuantitativa continua: Pueden tomar todos los valores de un intervalo.

# Organización y presentación de datos
Tablas: Excel, CSV, SQL

# Librerías
Pandas: 
- Se especializa en la manipulación y el análisis de datos.
- Ofrece estructuras de datos y operaciones para manipular tablas numéricas y series temporales, es como el Excel de Python.
Sklearn: 
- Es una biblioteca de aprendizaje automático gratuita
- También cuenta con algunas bases de datos

In [9]:
import pandas as pd 
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 'edad': [42, 52, 36, 24, 73], 'preTestScore': [4, 24, 31, 2, 3], 'postTestScore': [25, 94, 57, 62, 70]}

from sklearn.datasets import fetch_openml
titanic = fetch_openml("titanic", version=1, as_frame=True)  
titanic_frame = pd.DataFrame(data = titanic['data'])
titanic_frame

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN